08_api/pagemrkr/app/controllers/api/bookmarks_controller.rb

  def index
    bookmarks = Bookmark.all
---
SELECT "bookmarks".* FROM "bookmarks"

  def create
    bookmark = Bookmark.new
    bookmark.url = params[:url]
    bookmark.title = MetaInspector.new(bookmark.url).best_title
    if bookmark.save
---
INSERT INTO "bookmarks" ("url", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["url", "https://medium.com/dailyjs/functional-js-with-es6-recursive-patterns-b7d0813ef9e3"], ["created_at", "2018-08-09 01:58:21.845781"], ["updated_at", "2018-08-09 01:58:21.845781"]]