08_api/pagemrkr/app/controllers/bookmarks_controller.rb

  def index
    @bookmarks = Bookmark.not_archived.order(:title)
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."archived" = $1 ORDER BY "bookmarks"."title" ASC  [["archived", false]]

  def create
    @bookmark = Bookmark.new(bookmark_params) # mass assingment
    @bookmark.title = MetaInspector.new(@bookmark.url).best_title
    if @bookmark.save
---
INSERT INTO "bookmarks" ("url", "created_at", "updated_at", "title") VALUES ($1, $2, $3, $4) RETURNING "id"  [["url", "https://sass-lang.com/guide"], ["created_at", "2018-08-08 04:46:54.676826"], ["updated_at", "2018-08-08 04:46:54.676826"], ["title", "Sass: Sass Basics"]]

  def show
    # atomic operation
    Bookmark.increment_counter(:click_count, params[:id])

    # gives integrity problems because of concurrency

    # @bookmark = Bookmark.find(params[:id])
    # @bookmark.click_count += 1
    # @bookmark.save
    # redirect_to @bookmark.url
    redirect_to Bookmark.find(params[:id]).url
---
UPDATE "bookmarks" SET "click_count" = COALESCE("click_count", 0) + 1 WHERE "bookmarks"."id" = $1  [["id", 14]]
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]

  def destroy
    @bookmark = Bookmark.find( params[:id])
    if @bookmark.destroy
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = $1  [["id", 4]]

  def edit
    @bookmark = Bookmark.find(params[:id])
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    @bookmark = Bookmark.find(params[:id])
    @bookmark.url = params[:url]
    if @bookmark.save
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "bookmarks" SET "url" = $1, "updated_at" = $2 WHERE "bookmarks"."id" = $3  [["url", "https://guides.rubyonrails.orgs/"], ["updated_at", "2018-08-07 04:47:47.387325"], ["id", 3]]

  def archive_record
    @bookmark = Bookmark.find(params[:id])
    if @bookmark.archived == true
      @bookmark.archived = false
    else
      @bookmark.archived = true
    end
    if @bookmark.save
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "bookmarks" SET "archived" = $1, "updated_at" = $2 WHERE "bookmarks"."id" = $3  [["archived", false], ["updated_at", "2018-08-08 06:48:25.079120"], ["id", 16]]