08_api/pagemrkr/app/views/bookmarks/index.html.erb

SELECT "bookmarks".* FROM "bookmarks" ORDER BY "bookmarks"."title" ASC
---
  let newBookmarkForm = document.querySelector('.new-bookmark-form')
  newBookmarkForm.addEventListener('submit', (event) => {
    event.preventDefault()
    let urlValue = urlInput.value
    const options = {
      method: 'post',
      url: 'api/bookmarks/',
      dataType: 'json',
      data: {
        url: urlValue
      }
    }
    // aim
    // ajax post to api/bookmarks params
    $.ajax(options).done(res => {
      var $bookmarkDiv = $('<div>').addClass("bookmark")
      let $anchor = $("<a>").text(res.title)
      $anchor[0].href = res.url
      let $span = $("<span>").text(res.click_count)
      $bookmarkDiv.append($anchor)
      $bookmarkDiv.append($span)
      $(".bookmarks").prepend($bookmarkDiv)